package com.java.javarush.level7_functions.level7_1;


/**
 * Упорядоченная информация
 * Перед тобой — плохой пример использования методов:
 * <p>
 * Методы разделили двустишие;
 * Одну строку кода не стоит оборачивать в отдельный метод.
 * Перепиши код так, чтобы весь текст выводился в методе main, а остальные методы удали.
 * Вывод программы не должен измениться.
 */

public class Solution {
    public static void main(String[] args) {
        System.out.println("Я — поэт, зовусь я Цветик.");
        System.out.println("От меня вам всем приветик.");
    }
}






